#pragma once
#include <stdint.h>

// =========================================================================
// Структура дескриптора шлюза прерывания (64-битный режим)
// Описывает одну запись в IDT (Interrupt Descriptor Table).
// =========================================================================
struct idt_entry_t {
    uint16_t isr_low;       // Младшие 16 бит адреса обработчика
    uint16_t kernel_cs;     // Селектор кодового сегмента ядра (обычно 0x08)
    uint8_t ist;            // IST (Interrupt Stack Table) — номер стека (0..7), 0 если не используется
    uint8_t attributes;     // Тип шлюза и DPL (например, 0x8E для 64-битного шлюза прерывания)
    uint16_t isr_mid;       // Средние 16 бит адреса обработчика
    uint32_t isr_high;      // Старшие 32 бит адреса обработчика
    uint32_t reserved;      // Зарезервировано (должно быть 0)
} __attribute__((packed));

// =========================================================================
// Регистр IDTR (указывает на таблицу IDT)
// Загружается командой LIDT.
// =========================================================================
struct idtr_t {
    uint16_t limit;     // Размер таблицы - 1 (максимальный индекс * 16 - 1)
    uint64_t base;      // Линейный адрес начала IDT
} __attribute__((packed));

// =========================================================================
// Кадр стека, который формируется при входе в обработчик прерывания
// (сохраняется заглушками на ассемблере перед вызовом C-функции).
// Порядок соответствует сохранению в interrupts.asm.
// =========================================================================
struct interrupt_frame {
    // Регистры общего назначения (сохранены явно)
    uint64_t r15, r14, r13, r12, r11, r10, r9, r8;
    uint64_t rdi, rsi, rbp, rbx, rdx, rcx, rax;
    // rip - Адрес возврата
    // cs - Селектор кода
    // rflags - Указатель стека (может быть неактуален после смены стека)
    // ss - селектор стека
    uint64_t rip, cs, rflags, rsp, ss;
};

// Ассемблерные заглушки из interrupts.asm
extern "C" {
    void isr0();  void irq32(); void irq33();
}

// Глобальные состояния
extern uint64_t ticks;

// Интерфейс IDT
void idt_set_descriptor(uint8_t vector, void* isr, uint8_t flags);

// Интерфейс клавиатуры (для iostream)
void kbd_init();
void kbd_push(char c);
char kbd_pop(); 

namespace Interrupts {
    void init();

    void register_handler(uint8_t vector, void (*handler)());

    extern "C" void panic_handler(interrupt_frame* frame);
}